[
   [
      "https://freelance.habr.com/tasks/388437",
      "Разработать скрипт на Python забирающий данные (список) по REST API",
      "Разработать скрипт на Python(может и Json если доступно объясните целесообразность), умеющий самостоятельно забирать(обновлять) данные из Битрикс 24 (облако) для целей составления отчетов (обработка и интерпретация в визуальные отчеты-дашборды в системе PowerBi.Запуск скрипта, видимо будет происходить каждый раз автономно при запуске PowerBi Похоже что PowerBi запускает его(обновляет все подключения к разным базам в тч через скрипт) каждый раз когда нажимаем Refresh или заходим в PB-если это не так доработаем в будущем скрипт за отдельную плату, конечно.В PowerBi ничего придумывать не надо, там скрипт копипастом вставляется в окошко и все.Если плохо описал, то на «бизнесовом» задача звучит так:  Еженедельно выгружать(забирать скриптом) из Битрикс24(облако) и передавать в PowerBi список Бизнес-процессов RPA(Роботизация Бизнес процессов)."
   ],
   [
      "https://freelance.habr.com/tasks/388307",
      "Сверстать интерактивный дизайн демо-версии сервиса",
      "Имеется идея и дизайн сервиса по анализу последовательностей геномных баз данных, нужно за 2 недели сделать демо-версию этого сервиса. Контент встраивается прям в код, без Api, но в будущем придется подсоединять и его от python. Сейчас пока необходимо сделать просто \"кликабельную\" демку, с красивой анимацией по исходным данным, чтобы пользователь просто смог пощелкать и оценить пробный интерфейс. Примерный интерфейс размещен в приложении."
   ],
   [
      "https://freelance.habr.com/tasks/388195",
      "Backend-разработка на Python 3",
      "Мы ищем Backend-разработчика для почасовой работы (парт-тайм, фултайм) для разработки платформы для обучения математике и физике.Part.A – EdTech стартап, который занимается разработкой AI-ассистента преподавателя математики и физики, основанного на адаптивной методике асинхронного обучения.Наша Миссия – решить проблему нехватки учителей по всему миру. Согласно unesco, такая нехватка составляет порядка 70 млн. педагогов.Задачи:- Backend-разработка Python 3 (Django  Django REST framework, Postgres, Redis, Celery)"
   ],
   [
      "https://freelance.habr.com/tasks/388183",
      "Python скрипт для AWS EC2: Auto Scaling",
      "Необходимо написать скрипт для автоматического развертывания инстансов на Windows.\nОпыт работы c AWS обязателен.\n\nЯзык: Python\nБиблиотека: Boto3\n\nТехническое задание передам при общении.\n\nОплата: перевод на карту банка"
   ],
   [
      "https://freelance.habr.com/tasks/388181",
      "Python скрипт для AWS EC2: Auto Scaling",
      "Необходимо:\n1. написать скрипт для автоматического развертывания инстансов на Windows.\n2. разработать внутренний API для управления процессом скейлинга\n3. подключить AWS Budget Control\n4. конфиг для прогнозирования для автоскейлинга\n\n\nОпыт работы c AWS обязателен.\n\nЯзык: Python\nБиблиотека: Boto3\n\nТехническое задание передам при общении.\n\nОплата: перевод на карту банка"
   ],
   [
      "https://freelance.habr.com/tasks/388133",
      "Скрипт для парсинга telegram-каналов по ключевым словам",
      "Добрый день,Задача: разработка кода для парсинга telegram-каналов:Получение списка каналов согласно набору ключевых слов в постах групп и чатов (в том числе часть ссылки, разделенная точкой, например \"word1.word2\")Результат: рабочий файл для запуска в терминале python (Например, при помощи telephon).В комментариях прошу указать примерный срок в днях и стоимостьСпасибо за отклики!"
   ],
   [
      "https://freelance.habr.com/tasks/388125",
      "Доработать Hummingbot",
      "Нужно поставить Hummingbot в наш интерфейс."
   ],
   [
      "https://freelance.habr.com/tasks/388117",
      "OpenMV настроить детекцию объекта",
      "Настроить OpenMV на детекцию определённых образов. В отклике укажите телеграм"
   ],
   [
      "https://freelance.habr.com/tasks/388097",
      "Доработка проекта на Django",
      "Пишется складской сайт учета посылок.Требуется дописать пару приложение, такие как:- Личный кабинет юзера;- Всевозможные фильтры по посылкам и юзерам;- Разделение прав менеджера, складовщика и т.к.- Добавить пару JavaScript библиотек.И так далее, если у вас мало опыта в js или python, просьба проходить мимо."
   ],
   [
      "https://freelance.habr.com/tasks/387969",
      "Доработать робота на Binance + написать бэктест-систему",
      "Я понимаю как ты устал от однообразных неинтересных задач в программировании. В нашем проекте тебе действительно придется пошевелить мозгами, чтобы найти нетривиальные решения и реализовать их. У нас алгоритмический торговый робот, который торгует на спотовом рынке Binance. 〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️Задачи, которые необходимо сделать:1. Написать бектест систему под наш алгоритм.Система должна собирать графики по всем альткоинам с биржи Binance за 3 года. И по заданному алгоритму проходиться по всем графикам и примерять закладываемый нами алгоритм совершения сделок. Делать замеры, выводить отчет, графики. В алгоритме используются как общеизвестные индикаторы (macd,rsi,Bbands%), так и наши собственные разработанные фильтры.2. Вторая задача - доработка алгоритма робота.Усовершенствование уже имеющегося алгоритма. Дописывание необходимых модулей. Переработка существующих модулей. Доработка системы будет идти помодульно. То есть будем выделять кусок софта и дорабатыватьперерабатывать его.〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️〰️Для работы над данными задачами ищем программиста уровня MiddleSenior.В роботе мы придумываем нетривиальные решения и именно они позволяют нам конвертировать мозги в деньги. Поэтому и человека мы ищем такого же нестандартного и дотошного к деталям.Сразу скажу, работы много, в дальнейшем будем поддерживать систему. Требования к кандидатам:✅ Ваш уровень владения программированием MiddleSenior✅ Обязателен опыт работы в долгосрочных проектах✅ Обязателен опыт работы с торговыми роботами✅ Есть опыт работы с highload проектами✅ Желателен опыт работы в команде ✅ Умение разбираться в чужом коде✅ Знание языков PHP и Node.jsPython✅ У вас есть минимум по 40 часов в неделю (full time) на работу над проектом Крутой бонус для членов нашей команды! Мы даем каждому кто с нами - бесплатно зарабатывать на нашем продукте.В заявке обязательно указывайте:▪️Ставка в час▪️Откуда вы (город)▪️Сколько часов в неделю готовы выделять для работы?"
   ],
   [
      "https://freelance.habr.com/tasks/387933",
      "Разработать интеграцию в Home Assistant собственного API",
      "Требуется разработать интеграцию собственного API в HomeAssistant, который будет выполнять следующие задачи:Вводится в настройках URL к API.(опционально) Должна быть реализована ф-ция поиска URL контроллера путём сканирования всех IP в сети запросом HTTP. Можно рассмотреть поиск по mDNS.Вручную вводится токен авторизации API (через Auth Bearer).Подключение по Websocket к API с Auth Bearer. Переподключение при разрыве соединения.Создание в Home Assistant устройств на основе полученного по Websocket списка (JSON объект со списком устройств). Устройства могут быть следующих типов: реле, диммер, бинарный датчик, датчик температуры, RGB, термостат. Для начала можно реализовать только два-три типа.При получении обновлений из Websocket обновлять состояние устройств.При взаимодействии с устройствами в Home Assistant передавать через Websocket действия (новые значения)Мы предоставим API, к которому подключаться и минимальный код на JS, который устанавливает соединение и обновляет значение. От вас нужно два модуля (так принято в Home Assistant) интеграции - реализация WS API и взаимодействие с моделью устройств Home Assistant.Похожие проекты, из которых черпать аналогии и код:github.comhome-assistantcoretree25f411ef6ed0ad1afd778aa28e62e4bb7ced3011homeassistantcomponentszwave_jsgithub.comhome-assistantcoretree25f411ef6ed0ad1afd778aa28e62e4bb7ced3011homeassistantcomponentsdeconzБюджет обсуждается (вверх от указанной цены) в зависимости от того, сделаете вы всё или только каркас с парой типов и без поиска URL. Так же есть доп задачи, которые могут расширить это ТЗ и бюджет, если указанные этапы будут успешно реализованы.Требуется опыт работы с Home Assistant и понимание его структуры."
   ],
   [
      "https://freelance.habr.com/tasks/387913",
      "Парсер на python",
      "Есть список названий научных журналов. Список https:yadi.skiS-vTRSTXJXYrZQ1. По названию делать поиск журнала в поисковике и сохранять ссылку на журнал2. Открывать ссылку и искать rss ссылкиВ отклике укажите телеграм"
   ],
   [
      "https://freelance.habr.com/tasks/387911",
      "Парсер под Python",
      "Необходимо написать парсер под Python.ТЗ что должен уметь парсерПарсить все страницы сайтаСпарсеные страницы переименовывать в html файлы следущего типа: У сайта sss.ru(Для примера), парситься страница sss.rucatalogsertifikacia-iso.html(адрес возможен без .html). Необходимо получить страницу sertifikacia-iso.html создать в одной папке файл с адресом sertifikacia-iso.html очистить его содержимое, должен быть просто пустой html файл с адресом sertifikacia-iso.html. В этот файл на следующем шаге необходимо залить текст:  ---layout: urlurl-2{sertifikacia-iso}(в фигурные скобки подставляется адрес без html)title: '{Спарсеный заголовок}' (в фигурные скобки подставляется адрес заголовок со страницы H1)description: {Спарсеный заголовок со страницы H1}--- Во вторую папку залить html файл с таким же именем sertifikacia-iso.html, но текст будет заливаться в него другой, он будет одинаков для всех страниц.Парсер должен уметь работать со всеми сайтами, в том числе и по протоколу httpsДолжна быть возможность менять текст в первом и втором файле, желательно что-бы статическая часть текста подгружалась из файла. Бюджет предлагайте поставил на просто так, так как не знаю сколько это, нужно очень срочно. Без Бюджета в ответе не пишите лучше, что-бы время не тратить мое."
   ],
   [
      "https://freelance.habr.com/tasks/387883",
      "Доработать проект на Python",
      "Доработки по telegram-боту. работ ориентировочно на 20 часов.\nDjango + Telegram пакет\nПодробности скину исполнителю.\n\nВ откликах укажите, пожалуйста, контакт в Telegram."
   ],
   [
      "https://freelance.habr.com/tasks/387721",
      "Доработать торгового бота криптой на Pancakeswap",
      "Внести правки в торгового бота PancakeswapЗа мелкие правки 2000 рублейЕсть готовый торговый бот, он работает. Нужно внести правки, добавить много поток на проверку и еще по мелочиИли полностью создать заново 5000 рублейВидео бота + сверху немного на него одеть то что я попрошу, можно взять из старого бота и перенести туда, там почти все рабочие 70-80%https:www.youtube.comwatch?v=ehWDvw0jMzo"
   ],
   [
      "https://freelance.habr.com/tasks/387717",
      "Отображение баланса на binance в виде графика в реальном времени",
      "Необходимо сделать отображение баланса на бинанс в виде графика меняющегося в реальном времени."
   ],
   [
      "https://freelance.habr.com/tasks/387551",
      "Senior Fullstack Developer",
      "About Ergeon Ergeon aims to become the #1 trusted provider of tech-enabled home improvement. This rapidly growing, $250B+ US market is hampered by many inefficiencies that create a stressful, time-consuming customer experience. As tech-powered pioneers in this space, we provide an amazingly better experience using software, data, and industry expertise.Ergeon was founded and is run today by two CS serial entrepreneurs that share a deep passion for utilizing technology to improve how people work. We create innovative technologies that help consumers, contractors, and our all-remote staff excel.We have a fast-growing and diverse team spread across 30+ countries today. We go to great lengths to ensure that our workforce, everywhere in the world, has access to career growth, an amazing work culture, and great benefits. Join us to revolutionize the construction industry! Overview of the RoleWe are looking for a smart and enthusiastic full stack engineer to join our development team. Your primary focus will be the development of server-side logic ensuring high performance and responsiveness to requests, as well as building customer-facing and internal features for our applications. This includes working on our backend and API development, developing a friendly and responsive UI, helping build out our ReactRedux architecture, and continuously improving our tech stack for optimal performance. We’re prioritizing finding someone who has the proven ability to learn quickly and the drive to do so. ResponsibilitiesCreate scalable and robust backend architecture and APIsDevelop, test, and maintain robust, scalable, high-quality softwareImplement responsive and well designed UIsWrite highly organized, maintainable codeProvide mentorship to peers and junior colleagues CompensationAnnual salary between $37-$50 thousand USD, depending on experience Desired Skills and ExperienceMust haveExperience with Python, Django, and Django REST FrameworkSome SQL experienceSome Javascript experienceEagerness to learn new things and able to do so quicklyDeep care for user experience and producing high quality codeStrong computer science fundamentalsAvailability during the morning Pacific Time (6am-10am)Comfortable working remotely with a distributed teamNice to haveExperience with ReactReduxDocker experienceExperience working in a distributed teamExperience with Scrum or other agile development process BenefitsStock optionsFlexible paid time off (PTO)$200 reimbursed annually for learning, softwarehardware or workplace improvements and fitness related spendingHeadset reimbursementLaptop replacement of up to $2,000 reimbursed after 1 year of full time work and every 3 years after"
   ],
   [
      "https://freelance.habr.com/tasks/387433",
      "Подготовка теоретической базы для образовательного проекта",
      "Насмотревшись на хаос и инфоцыганство, царящие сейчас на рынке онлайн-образования в Рунете, мы решили создать качественно новый образовательный проект, в котором будут учтены все недостатки современных курсов по программированию.Цель проекта YtYt.ru - создать единую образовательную среду, в которой начинающие программисты смогут быстро получить актуальные знания и, что гораздо важнее, научиться их применять под надзором код-ревьюеров. В этом направлении неплохо продвинулся Hexlet, но мы хотим сделать еще лучше, еще качественнее.Работа над проектом ведется уже почти год, все понемногу начинает шевелиться, но к сожалению, недавно один из ключевых разработчиков оставил нас, так как получил великолепный оффер, релоцировался и не смог совмещать возросшую нагрузку с участием в проекте.В связи с этим мы сейчас находимся в поиске парт-тайм разработчика на Python с опытом работы в команде и стажем не менее 3 лет. Задач много, как минимум на несколько месяцев.2 типа задач, над которыми предстоит работать:- Подготовка теоретической базы для уроков в рамках заданной учебной программы. Только текст и код в .ipynb; сухая теория и немного примеров. Готовить урок под ключ или формулировать предложения так, чтобы они красиво звучали, не нужно. Достаточно кратко изложить материал своими словами, а затем методист и копирайтер сделают все остальное. Пример исходного материала и готового урока будет предоставлен по запросу.- Поддержка существующей платформы YtYt.ru (только бэк, Django + Docker).Оплата почасовая (другие варианты тоже обсуждаемы, если так вам будет удобнее).Идеальный портрет разработчика, на который мы ориентируемся:- опыт работы от 3 лет (либо чуть меньше, но с хорошим, интересным гитхабом);- опыт работы над коммерческими проектами в компании (не только на фрилансе);- желание делиться накопленным опытом и знаниями;- уверенное владение Django, Docker и Docker Compose;- возможность принимать оплату на расчетный счет как ИП или самозанятый (опционально, но это будет преимуществом).С чего начнем:Если задачи вам интересны, то в отклике укажите, пожалуйста, проекты, над которыми вы работали, и ваш примерный скилл-лист (что знаете, что умеете). Далее вам будет предложено оплачиваемое тестовое задание (написать 1 урок), по результатам которого и вы поймете, насколько задача вам подходит, и мы поймем, насколько нам подходит ваша реализация."
   ],
   [
      "https://freelance.habr.com/tasks/387363",
      "Сопоставление (matching) одинаковых товаров из разных интернет магазин",
      "С помощью машинного обучения нужно решить задачу и написать скрипты для сопоставления (matching) одинаковых товаров из разных интернет магазинов.На 1х тестах будет 1-3 крупных ИМ (Yandex Market, WildBerries, Ozon). Собранные данные по всем товарам с нашей стороны (парсеры у нас есть, точный формат предоставляемых данных обсудим с исполнителем) - заголовки названия товаров (title), описания, характеристики (атрибуты и их значения), цены, картинки. Также дособерем любые другие данные, если нужно.Учесть, что ассортимент каждого магазина будет огромным (WildBerries - 19 млн. товаров, Yandex Market - 3 млн. товаров).По простому говоря например для WildBerries и Yandex Market система на выходе должна указать, что данные товары одинаковые:https:www.wildberries.rucatalog37769916detail.aspxhttps:market.yandex.ruproduct--chasy-naruchnye-sergio-tacchini-st-1-10015-1929439136ОБЯЗАТЕЛЬНО изучите более полное описание задания в GoogleDocs по ссылке:https:docs.google.comdocumentd1ATQeY6ZnCcRsle...Предполагаем, что алгоритм сравнения товаров должен учитывать с помощью машинного обучения сходство заголовков, цен, характеристик и картинок товара. Т.е. комбинация текстовых параметров и сходства изображений.Используемые подходы и технологии:python, компьютерное зрение, computer vision, машинное обучение, machine learning, deep learning, opencv, tensor flow, data science, нейронные сетиГотовы выделить свои сервера для выполнения задачи.  Требования к исполнителю:Исполнитель должен иметь опыт работы в области машинного обучения с большим объемом данных.Исполнитель должен иметь опыт работы с программированием на Python.В отклике на проект ОБЯЗАТЕЛЬНО укажите проекты над которыми работали и коротко подтвердите выполнение подобных работ (чтобы после отклика хоть как-то было понятно, что с Вами можно обсуждать подобную задачу и приступать к сотрудничеству).  Порядок работы и оплаты:Согласовываем с исполнителем цену (строго в рублях) и сроки. Если условия устраивают и меня и вас - работаем!Работаю строго без предоплат! Можем договориться о поэтапных постоплатах, но только постоплатах по факту выполненных работ!"
   ],
   [
      "https://freelance.habr.com/tasks/387279",
      "Скачать датасет и сделать описание содержимого",
      "Есть список из 30+ датасетов. Нужно их выкачать и посмотреть есть ли разметка записей по возрасту. Если есть нужно посчитать средний возраст и диапазон. Задача не сложная, но нужно знать питон, иметь хороший интернет и работать оперативно"
   ],
   [
      "https://freelance.habr.com/tasks/387121",
      "Формирование баз данных",
      "Нужно собрать информацию со следующих источников: Avito, ЦИАН по установленным параметрам (предоставляются). Парсеры должны собрать базу данных с каждого из источников. Формат файлов - xls.Результат: Базы данных, собранные по каждому источнику. Формат файлов - xls."
   ],
   [
      "https://freelance.habr.com/tasks/387051",
      "Платформа-пульт управления для VR-аттракциона",
      "Для помощи в работе над проектом требуется специалист со следующими компетенциями:→ Знание python3.→ Знание reactvueлюбого другого популярного фреймворка.→ Знание sql-подобных баз данных (rds-sql).Мы разрабатываем платформу-пульт управления для vr аттракциона. На текущий момент она состоит из 4 компонентов. Интерфейс управления Сервер верификации Агенты запуска Бэкенд статистики и разрешений для разных площадок По планируемым задачам - 1) приведение бд в человеческий вид (rds-sql), просто разбитие хотя-бы до 2nf 2) разработка spa приложения, которое в зависимости от состояния платформы будет показывать демонстрационный ролик или скоринг игроков 3) рефакторинг проекта, улучшение взаимодействия между сервером контроля и агентами 4) добавление новых запросов в aws api gateway и lambda для доступа к бд по новым путям Проект на 2-3 недели максимум.Для работы над проектом с Вами будет заключен договор. Можете писать сразу в Телеграм: @Ponyashazaza"
   ],
   [
      "https://freelance.habr.com/tasks/386969",
      "Разработка Backend для мобильного приложения Python + django + postgre",
      "Добрый день. Разрабатываем приложение для внутренних нужд компании, это задачник + чат, который адаптирован под нужды и специфику нашей компании. НА данном этапе есть кликабельный прототип с комментарием и техзадание для бекенда. Стек планируем такой React Native +  Django + PostgreSQLНа данном этапе ищем Python Разработчика, с опытом работы от 3 летКрайне желателен опыт работы с похожими проектами, а именно: приложение с множеством пользователей, личные и групповые чаты, разные роли в задачах (исполнитель, постановщик), заметки по задачамПо предварительной оценке это работа на фулл тайм на проект(MVP) на 3-4 месяца. Но бывает по-разному.Кому интересно - давайте пообщаемся))Спасибо за внимание"
   ],
   [
      "https://freelance.habr.com/tasks/386963",
      "Выгрузка данных из касс Эвотор (Evotor) через API",
      "Реализовать выгрузку данных о продажах и остатков товаров из касс Эвотор (Evotor) через API Evotor (https:api.evotor.rudocs) в БД для последующей визуализации в PowerBI.Преимуществом является опыт в построении аналитики.Бюджет заведомо больше, т.к. будут допиливания функционала."
   ],
   [
      "https://freelance.habr.com/tasks/382967",
      "Разные задачи по React.js  Node.js  Angular.js, .NET, React Native",
      "[10.09.21; покуда опубликовано - актуально]Компания, последние 10+ лет работающая с зарубежными заказчиками, ищет несколько middle  senior разработчиков на ряд актуальный проектов в основном связанных с указанным в тэгах стэком (PHP & Python в данный момент более не актуальны). Средняя продолжительность каждого до полугода+.Ставки:15$  ч. middle (от 2+ лет опыта коммерческой разработки).20$  ч. senior (от 5+ лет). В последующем возможен пересмотр на 25$  ч.Рассматриваются как индивидуальные фрилансеры, так и аутстафф. Актуально как для РФ, так и СНГ.По всем вопросам обращайтесь в телеграмм @doomer_gg с указанием:1. Желаемой ставки в час  подтверждением, что устраивает указанная.2. Резюме (CV) на английском.В последующем также потребуются ответы на короткий список вопросов."
   ],
   [
      "https://freelance.habr.com/tasks/386887",
      "Написать модуль загрузки данных",
      "Необходимо:1. Написать модуль для загрузки данных.2. Реализовать работу БД со скоростью обработки в 3-4 сек, с просмотром загруженных данных стандартными методами ПО.Результат:Данные загружаются и отображаются. Код описан, инструкции созданы, технологический стек указан. Логирование данных реализовано, ПО упаковано в Docker."
   ],
   [
      "https://freelance.habr.com/tasks/388455",
      "Разработать desktop сервис на Python",
      "Задача - разработать десктоп-сервис на Python, который будет автоматически запускаться в ОС, открывать WebSocket, через который будут отправляться команды со стороны браузерных веб-клиентов.Команды будут затрагивать различный функционал - от взаимодействия с устройствами, подключенными к компьютеру, до обращения во внешние БД.Подробное описание по ссылке https:docs.google.comdocumentd1Wdc5W3AacuEvcC...Пожалуйста, в отклике на задачу указывайте:- вашу рабочую ставку- начальную оценку трудозатрат- сроки выполнения- ваш город  регион, таймзонуВ случае успешного выполнения данного этапа, будет предложена дальнейшая разработка приложения.Телеграм для связи @x023xx"
   ]
]