[
   [
      "https://freelance.habr.com/tasks/388421",
      "Нужен фронтенд на Vue.js",
      "Есть игровой проект на Nuxt.js + Laravel, которому очень нужны доработки функционала. Пул задач расписан на 3+ месяца. Ищем крепкого фронтендера на почасовую оплату. Готовы хорошо оплатить вашу работу. \n\nВ отлике напишите вашу ставку и 1-2 ссылки на примеры вашего кода (на vue)."
   ],
   [
      "https://freelance.habr.com/tasks/388339",
      "Проект на laravel - модуль для онлайн-теста пользователей",
      "На основе существующей системы разработать пошаговый тест для пользователя Несколько вопросов, которые показываются пользователю после ответа на предыдущий. Вопросы с ответами приходят по запросу apistep и туда же отправляются результат.Вопрос и варианты ответа уходят на клиента в виде готового htmlВ результате нужно получить таблицу со всеми ответами пользователя.+ микро-админочка для Макетов нет, все можно через сваггер + постман реализовать."
   ],
   [
      "https://freelance.habr.com/tasks/388335",
      "Frontend разработка CRM на VueJS (Vuexy)",
      "Для фронтенда задача максимально упрощена - есть шаблон Vuexy, на котором уже начали делать проект. Backend на Laravel. Backend-разработчик есть. Для обмена роутами используем Postman.\n\n\nПодготовлены макеты в Figma. Разработка уже в процессе. Спроектирована база данных для MVP. Расписаны основные сущности и функционал текстовым описанием.\nГотовы разделы: авторизациярегистрация, настройкироли, клиенты, карточка клиента.\n\nТЗ детальное, однако некоторые нюансы будем обсуждать находу.\n\n\nО проекте:\n\nService Rocket - это веб-приложение для автоматизации сервисного обслуживания объектов и выездных сотрудников компании. По сути напоминает CRM-систему, но со своими нюансами и деталями. Есть разделение прав доступа на аккаунты компаний, карта объектов обслуживания, сотрудники со своими правами доступа, заявки на обслуживание, список обслуживаемого оборудования, статусы заявок и др.\n\n\nТребования к кандидату:\nОпыт работы с VueJS (+Vuex) - обязателен.\nОпыт работы с шаблоном Vuexy, разработки CRM-систем и опыт в UXUI взаимодействии будет большим плюсом!\n\n\nСкрины из Figma прикрепляю.\nПишите, если вас заинтересовал проект."
   ],
   [
      "https://freelance.habr.com/tasks/388283",
      "Добавить модуль вакансий на сайт",
      "Ищем разработчика на задачу для проекта proghub.ru. Сложность задач junior. ТЗ подробно расписано и подлежит обсуждению. Из требований - знания laravel, react+next.js.ТЗ - https:productive-practice-00b.notion.siteVacanc..."
   ],
   [
      "https://freelance.habr.com/tasks/388279",
      "Перевести на английский сайт и добавить функционал",
      "Сложность задач junior. ТЗ подробно расписано и подлежит обсуждению. Из требований - знания laravel, react+next.js. Ссылка на ТЗ: https:productive-practice-00b.notion.siteproghu..."
   ],
   [
      "https://freelance.habr.com/tasks/388093",
      "Требуется сверстать и интегрировать шаблон на e-commerce проекте",
      "Ищу человека, который сможет закрыть фронтенд разработку. Сам проект реализовывается на laravel. Исполнитель должен будет сверстать шаблон и так же написать js код, желательно vue.js, для корректной работы ajax запросов и т.д."
   ],
   [
      "https://freelance.habr.com/tasks/388069",
      "Доработка сайта и crm на Laravel",
      "Добрый день,ищу человека для доработки уже созданного самописного сайта и небольшой CRM на Laravel.Хорошо знаю, что поддержка кем-то ранее написанных веб-проектов занятие зачастую не сильно приятное, но текущий фриланс-разработчик ушел в другие проекты, подыскиваю человека для доделок.Что нужно: - Опыт работы с Laravel- Опыт работы с Git- В целом вменяемый опыт фулл-стэк разработки веб-проектов различной сложности- Указать ваш рейт в час, т.к. оплата на почасовой основе- Иметь достаточное колво время для работыПланируемая объём работы по 50-100 часов в месяц, на ближайшие 2-3 месяца, а дальше будет видно. Постараюсь рассмотреть все отклики и связаться с парой потенциальных исполнителей."
   ],
   [
      "https://freelance.habr.com/tasks/388029",
      "Laravel mail очереди",
      "Laravel mail очередиТз приложен"
   ],
   [
      "https://freelance.habr.com/tasks/388009",
      "Доработать фронт на Vue.js",
      "Требуется опытный фронтенд( Vue.js) или фулстак (+ Laravel) разработчик для доработок сайта, добавления новых разделов, подключения сторонних сервисов.Работа по БС исключительно!Если все пойдет хорошо, для плавного перехода на новый проект с нуля (тоже наш проект).Обязательные требования, ответ лучше сразу дать по пунктам, чтобы не терять ни вашего, ни своего времени на обсуждение:1) Опыт работы и отличные знания Vue.js иили Laravel2) Вы на связи в рабочее время (по вашему графику)3) Не имеете привычку неожиданно пропадать4) Не берете несколько проектов сразу5) Можете дать ссылки на выполненные проекты и гитхаб6) Готовы приступить к работеПосле предварительного отбора дам доступ к задачам в Трелло.Сумма указана произвольно, работа оценивается и оплачивается позадачно.Лендинги, продвижение, Вордпрес(и аналоги), дизайн - НЕ ИНТЕРЕСУЮТ!Студии тоже не очень интересуют.Для защиты от ботов, напишите +1 перед вашим комментарием к проектуСпасибо за интерес к проекту! Обязательно всем отвечу!"
   ],
   [
      "https://freelance.habr.com/tasks/387965",
      "Доработка сайта + Разработка  тг-бота + Доработка админ панели",
      "Ищу full stack разработчика на крупную доработку проекта. Всего 3 крупные задачи. Архитектура проекта в Miro. Общий объем работ составляет порядка 35-40 часов. Требуется опыт с php, laravel. База написана на SQL.  В откликах прошу указать тг для связи ."
   ],
   [
      "https://freelance.habr.com/tasks/387951",
      "Разработать бекенд на Laravel 8",
      "Необходимо разработать бэкенд на Laravel для сайта онлайн знакомств.\nФронтенд полностью готов.\nБез админки, но нужно будет предусмотреть дальнейшую реализацию админки.\nРассматриваем долгосрочное сотрудничество. Своевременные поэтапные выплаты."
   ],
   [
      "https://freelance.habr.com/tasks/387761",
      "Внедрить макет дизайна на Laravel",
      "МакетВ отклике напишите срок и желаемую сумму за проект."
   ],
   [
      "https://freelance.habr.com/tasks/387715",
      "Сделать небольшие доработки на портале Laravel + Vue.js",
      "Есть проект на Laravel + Vue, которому очень нужен еще один разработчик. Ищем full-stack разработчика на почасовую оплату.Stack:- PHP ^7.4- Laravel ^8- Vue.js ^2.6- MySQL- Element UIБолее подробно задание обсудим с исполнителем.В отклике напишите вашу ставку и 1-2 ссылки на примеры вашего кода (на Vue и PHP)."
   ],
   [
      "https://freelance.habr.com/tasks/387653",
      "Доработки сайта на Yii2",
      "Необходимы постоянные доработки на проекте написанном на Yii2. Проект большой, можем загрузить на фуллтайм.\n\nНужны опытные PHP разработчики со знанием:\n PHP и MYSQL\nопыт работы с каким-либо php-фреймворком (YII2, Laravel, Symfony …)\nпонимание принципов ООП\nElasticSearch и Sphinx,\ndocker\nmvc\n\n\nДетали задач обсуждаем индивидуально"
   ],
   [
      "https://freelance.habr.com/tasks/387639",
      "Помощь в разработке приложения на Laravel + Vue",
      "Необходима помощь в разработке приложения по ТЗ. Основная работа это реализация API(часть уже реализована + помощь в написании бизнес логики). Стэк для бэка Laravel8, Redis, MySQL(Eloquent по большей части) на фронте Vue 2. Ищем либо мидлов фулстака либо отдельно бэка. Для джунов тоже найдутся задачи. Работа примерно на 2-3 месяца, возможно дальнейшее сотрудничество."
   ],
   [
      "https://freelance.habr.com/tasks/387537",
      "Нужен фронтенд на Vue.js",
      "Есть игровой проект на Nuxt.js + Laravel, которому очень нужны доработки функционала. Пул задач расписан на 3+ месяца. Ищем крепкого фронтендера на почасовую оплату. Готовы хорошо оплатить вашу работу.\n\nВ отлике напишите вашу ставку и 1-2 ссылки на примеры вашего кода (на vue)."
   ],
   [
      "https://freelance.habr.com/tasks/387529",
      "Собрать бэкенд проекта на Laravel + Vue.js",
      "Здравствуйте.\n\nКорпоративный сайт + небольшой двухуровневый каталог продукции. Стек:Laravel, Vue.js Среда разработки Atlassian: Jira, Confluence, Bitbucket. Фронт доделывается, документация готова – дам доступ по запросу в личку. \n\nСтарт на следующей неделе после доведения шаблонов фронта.\n\nПостоплата."
   ],
   [
      "https://freelance.habr.com/tasks/387453",
      "Платформа для предоставления архивных и генеалогических записей",
      "Открытая платформа для предоставления её пользователям возможности \nразмещать архивные и генеалогические данные по типу ОБД-Мемориал, \nMyHeritage и им подобных с элементами интернет-магазина записей, а также\n биржи заказов по типу фриланса.\nНеобходимо произвести рефакторинг существующей системы (chronolog.online), находящейся на стадии рабочего тестирования.\nПредполагаемый фреймворк для осуществления задачи - Laravel, однако,\n возможно, для удовлетворения всех требований проекта потребуется \nреализация на Django или даже использование Serverless Technologies."
   ],
   [
      "https://freelance.habr.com/tasks/387371",
      "ПрограммистLaravel для доработки существующего проекта (интернет магаз",
      "Ищем Laravel разработчика со знанием vue.js для доработки интернет-магазина. Есть полный список правок, которые необходимо доработать, в основном это баги, но также есть и новый функционал, который надо добавить. Можем предоставить перечень правок, доступ на гитхаб, доступ в админ панель и ссылку на сам проект, чтобы посмотреть. Бюджет 500 дол (но возможен пересмотр после вашей оценки)Сроки - 2 неделиНеобходимые навыки и требования:- laravel- vue- postgresql  mysql- gitПосле завершения работы над проектом и успешного сотрудничества, сможем предложить работу над новыми проектами."
   ],
   [
      "https://freelance.habr.com/tasks/387367",
      "Программист Laravel под проект туристической тематики (тураргеатор)",
      "Программист Laravel под проект туристической тематики (сайт аргеатор туров)Ищем второго программиста под проект на длительное сотрудничество. Проект уже разрабатывается второй месяц, заложена основа, архитектура, разработаны первоначальные функции, сейчас на проекте работает один бэкенд специалист, два фронтенд разработчика, дизайнер, тестировщик. С третьего месяца в команду нужен второй бэкенд специалист (с 1 октября).Общая длительность проекта с момента вашего подключения в команду разработки - 6-7 месяцев. После первого месяца работы сдаемMVP версию продукта. После окончания основной разработки над проектом, будут новые задачи по нему же + по другим проектам. Весь проект уже разбит на этапы, просчитано время разработки первым программистом. Время, которое необходимо выделять на разработку проекта, варьируется от месяца к месяцу - от 98 до 132 часов в месяц. Необходимые навыки и требования:- laravel- vue- postgresql  mysql- gitО проекте. Стартап, маркетплейс и агрегатор туров, с 4мя типами юзеров, возможностью добавить свой тур, покупки тура, корзиной, оплатой, реферальной системой, программой лояльности и системой баллов, верификацией личности, платными функциями и множеством других функций.Можем предоставить полное техническое задание для изучения и оценки, а также информацию по всем этапам, с заранее заложенной оценкой по времени от программиста, который в данный момент занимается проектом."
   ],
   [
      "https://freelance.habr.com/tasks/387351",
      "Натянуть верстку на ларавель + сделать небольшое тз",
      "Натянуть готовую верстку на текущий сайт, надо переделать сайт под инвестиции,убрать игры, настроить получение на почту уведомлений (регистрация, напоминание пароля).весь функционал остается включая админку, там только произойдет замена игр на ставки по графику.график будет сделан по логике отдельно, будет писать данные в json и складывать в папку, надо будет будет его привязать к сайту, там выбор валюты пары и ставка, это отражается потом в кабинете пользователя и в админке.сайт на laravel.работа через гит, с коммитами раз в 2-3 дня.верстка личного кабинета http:cy45046.tmweb.ruбудет еще несколько контентных и 1 лендинг главная - в другом дизайне.бюджет 25 тыс руб, срок сделать за 1 неделю примерно натянуть верстку, и 1 неделя поправить функционал, и довязать график."
   ],
   [
      "https://freelance.habr.com/tasks/387225",
      "Добавить функционал отзывов на sysrqmts.com",
      "Мы хотим добавить сбор отзывов пользователей на сайт https:sysrqmts.com\n\nПодробное ТЗ здесь:\nhttps:docs.google.comdocumentd1YWKfJFTJ1qEsJ50D6XSrvA6eIz85HJV6NH4tRuqZJXAedit?usp=sharing\n\nДизайна для модалки сбора отзывов нет. Можно сделать на свой вкус, главное чтобы работало.\n\nПредлагайте свои сроки и стоимость исполнения в комментариях."
   ],
   [
      "https://freelance.habr.com/tasks/387215",
      "Связка Laravel + Vue",
      "Добрый день! \nПолностью готов Front-End на Vue + Nuxt\nА также готов бекенд Laravel, апи примерно на 20 методов\n\nРаботы примерно на 4-7 дней, смотря кто как быстро работает )\n\nИсходники на оценку предоставлю кандидатам."
   ],
   [
      "https://freelance.habr.com/tasks/387033",
      "Публикация сайта на VDS",
      "Необходимо: 1. Настроить VDS-сервер (на Docker контейнерах)2. Привязать к нему домен3. Развернуть проект на Laravel (исходники предоставлю)4. Подключить к проекту БД (PostgreSQL) и провести миграцию5. Провести тестирование, чтобы все корректно работало Вкратце развернуть сайт из предоставленных исходников и предоставленном доступе к серверу под ключ. Жду ваших предложений."
   ],
   [
      "https://freelance.habr.com/tasks/386939",
      "Доработать сайт на Laravel и Vue.js",
      "Ищу Laravel разработчика иили Vue.js разработчика(ков)Есть готовый сайт на Laravel 5.7 и Vue.js 2 - биржа фотомоделейНужно добавить на него функционал и попутно исправлять баги.Работы примерно по 20 часовмесяц в течение 2-3 месяцев.Ближайшие крупные задачи:Сделать отправку уведомлений пользователям через мессенджер при некоторых событиях на сайтеСделать систему оплаты для клиентов и систему выплат для моделей (юкасса)Множество более мелких доработокСтавка 750 рубчасСразу пишите ваш опыт с laravelvue и скидывайте примерыВ дальнейшем возможно сотрудничество на постоянной основе."
   ],
   [
      "https://freelance.habr.com/tasks/388417",
      "Программист битрикс",
      "Для редактирования основного сайта компании (верстка и программное наполнение). Динамические страницы, выборки из базы данных по критериям требуется программист Битрикс.  Требования: • PHP, MySQL, PostgreSQL (будет плюсом). Умение работать с запросами к My SQL. • Photoshop, Html, CSS. • практические знания PHP7.1+: (namespaces, traits, etc), стандартов PSR, SOLID принципов, умение пользоваться одним из отладчиков типа xDebug; • Опыт работы с bootstrap, Git, BitBucketGitHub или Mercurial, REST, SOAP. Написание собственных API будет плюсом. Обмен данными в XML, JSON   ● опыт создания парсеров;   ● знание регулярных выражений;  ● базовые знания администрирования вебсервера (Apache+NGinx+IIS);  ● опыт на Yii2 Framework будет плюсом"
   ],
   [
      "https://freelance.habr.com/tasks/388385",
      "HTML верстка сайта",
      "Необходимо сверстать сайт-визитку из figma. Если работаете с CMS, можете перечислить их. Так как в дальнейшем планируется подключение к админке"
   ],
   [
      "https://freelance.habr.com/tasks/388347",
      "Проект на php и mysql",
      "Суть проекта - админка которая создает и управляет несколькими другими сайтами.пример сайтов, которые должна создавать админка:https:sport.eurodo.co.ukopinion-euhttps:craft.eurodo.co.ukopinionhttps:ezmatcha.comopinionВерстка уже есть, нужно сделать так, чтобы верстка работала + настроить авторизацию пользователяДетали сброшу откликнувшимся"
   ],
   [
      "https://freelance.habr.com/tasks/388345",
      "Сверстать 3 psd-макета и натянуть на DLE. Полный Функционал",
      "Работа через безопасную сделку.(Т. е исполнитель получит 6Кр)Есть 3 psd шаблона для одного аниме-сайта: главная, категория и страница аниме.Необходимо на готовом сайте про мультфильмы(на DLE) сверстать(+адаптивка) и натянуть эти шаблоны для аниме-раздела. В итоге нужен полностью рабочий раздел Аниме со своими категориями и работающим фильтром по дополнительным полям. PSD шаблоны простые(пример: prnt.sc1rka07l)Более детальную информацию и особенности данного проекта можно получить в личке или после установления факта сотрудничества.Обязательное знание DLE и опыт работы в подобных проектах. В итоге хотелось бы получить готовую работу под ключ с минимальными исправлениями."
   ],
   [
      "https://freelance.habr.com/tasks/388293",
      "Верстка",
      "Нужно сверстать 10-15 страниц, остальное мелочи по сайту, их много. Сайт большой.Ставка 700 рублей в час, предпочтение отдам кто знает Angular4+"
   ],
   [
      "https://freelance.habr.com/tasks/388267",
      "Адаптивная верстка дашборда на Figma: htmlcssjs",
      "Мы ищем фронтенд разработчика для верстки дашборда на фигма.\n\nТребования:\n- FlexGrid. Не используем бутстрап. Абсолютное позиционирование только в исключительных случаях, когда без него никак.\n- Верстка по БЭМ, чтобы мы могли экспериментировать с расположением блоков вышениже и ничего не ломалось.\n- Проверяем на переполнение блоков, т.к. данных может быть больше, чем показывает макет. \n- JS по возможности в один файл, т.к. для нас важно Google Page Speed.\n- Валидность кода + Google Page Speed стараемся соответствовать максимально.\n\nПрикладываю несколько экранов ЛК, после выбора исполнителя представим полный шаблон Figma.\nВ отклике прошу указывать ссылки на репозиторий с вашими последними работами и среднюю ставку."
   ],
   [
      "https://freelance.habr.com/tasks/388219",
      "Верстка сайта и интеграция с Битрикс",
      "Нужно по готовому дизайну сделать верстку сайта и интеграцию с Битрикс. Тематика - медицинский центр. Дизайн предоставляем в Фигме.Лицензия Битрикс есть.Формат работы предлагаем через безопасную сделку или по договору (в этом случае предпочтительно если у исполнителя будет ИП).Структура сайта:Главная - слайдер, вывод карточек врачей, карточек с отзывами, карточек с оборудованиемО центре - текстовая страница с описаниемСпортивным организациям - текстовая страницаКорпоративным клиентами - текстовая страницаПравовая информация - текстовая страницаУслуги - список катгорий и подкатегорий с услугамиПодробное описание услуги - текстовая страницаВрачи - вывод карточек врачей с описаниемСтраница врача - текстовая страницаАкции - текстовая страницаОборудование  - вывод карточек с оборудованиемОтзывы - вывод карточек с отзывамиИстории успеха - вывод карточек с анонсамиОписание истории успеха (лечения) - текстовая страницаКонтакты  - текстовая страницаОшибка 404 - текстовая страницаК сожалению не получается загрузить все макеты. Оплата за проект договорная, на основе сметы проекта."
   ],
   [
      "https://freelance.habr.com/tasks/388185",
      "Сверстать макет фотокниги",
      "Есть 35-40 фото, нужно расположить их на 20-30 разворотах. Без рамок, на всю страницу, некоторые фото можно компоновать, некоторые просто целиком на одну страницу.\nИ сделать симпатичную обложку.\nРезультат в виде jpg файлов пронумерованных."
   ],
   [
      "https://freelance.habr.com/tasks/388173",
      "Функционал с версткой через гит на open cart 2.3",
      "wines-es.com Необходимо реализовать \"подарок\" на нашем сайте Верстка с функционалом open cart 2.3 работа через гит поэтапная оплата без предоплат приступать надо сегодня __ ссылка на примеры: https:disk.yandex.ruiEIz9HMvBJc7ayQ https:disk.yandex.rui4O1QBJiUbxOlQw"
   ],
   [
      "https://freelance.habr.com/tasks/388167",
      "Адаптивная верстка 2х страниц",
      "Макет по ссылке для ознакомления\nhttps:www.figma.comfileRqkdsM09Ak8zIweaW2soh6Untitled?node-id=2%3A3\n\nТребования к верстке:\nКроссбраузерность, включительно IE и Safari\nСоответствие макету\nGoogle page speed 85+\n\nМакет мобильной версии есть."
   ],
   [
      "https://freelance.habr.com/tasks/386263",
      "Шаблон HTML5 ReactJS + Tailwind CSS перенести на HTML5",
      "Нужно переверстать шаблон ReactJS + Tailwind CSS с themeforest.net на HTML5.Есть проект прайс агрегатор.Хотим использовать указанный ниже шаблон с небольшими модификациями:добавить меню бургер с цветными иконками категорий типа wb.ru, satom.ru, youla и сдвинуть логотипсделать видной строку поиска и с рамкой по краям, как на ozon.ruубрать текстовое верхнее горизонтальное менюДетали по переделкам бургера и поиска сообщим после отбора кандидата.Шаблон должен корректно смотреться и на десктопах и на мобильных устройствах. Детали обговоримХочется получить быстрый и качественный шаблон, но не хочется заказывать дизайн с нуля. Достаточно взять бесплатный или платный (но не дорогой) шаблон и его немного переделать (логотип и еще несколько мелочей).Остановились на варианте шаблона на React + Tailwind CSS:https:themeforest.netitemchawkbazar-react-next...Конкретный вариант для переноса:https:chawkbazar.vercel.appvintageНужно ли нам его купить или Вы сможете восстановить его по HTML коду (желателен вариант без покупки)?В отклике обязательно указать сколько примерно по времени может занять данная работа (с учетом доработок по бургеру и поиску)! Указать примеры Ваших работ!Порядок работы и оплаты:Согласовываем с исполнителем цену (строго в рублях) и сроки. Если условия устраивают и меня и вас - работаем!Работаю строго без предоплат!"
   ],
   [
      "https://freelance.habr.com/tasks/388115",
      "Верстка и фронтенд ( Vuetify )",
      "Задачи - работа с фронтендом и версткой ( Vuetify )\nНужно доверстать уже существующие страницы , добиться точности \nна сколько это возможно . Шаблоны только в Adobe Ilustrator (ai) .\n\nКак будем работать:\nсвязь в телеграмме \nвсе задачи будут ставиться непосредственно по макету.\n- смотрим в макет и сравниваем как выглядит сайт ровняем и исправляем недоверстанное .\nВажно чтобы по сдаче верстанных элементов не поползло все вокруг - потому исправление касаются всего сайта а не конкретной страницы . Прежде чем приступите вам будет показан существующий рабочий сайт и предоставлены макеты . \nПрошу оставить свой телеграмм только тех кто работал и хорошо знает Vuetify  ."
   ],
   [
      "https://freelance.habr.com/tasks/388109",
      "Доверстать адаптивное меню на OpenCart",
      "Есть - сайт на OpenCartХотим обновить дизайн. Необходимо доверстать адаптивное меню, т.к. прог не силен на фронте."
   ],
   [
      "https://freelance.habr.com/tasks/387633",
      "Перенос действуюшего личного кабинета пользователя на новый диайн",
      "Дано:- Работающий личный кабинет на чистом PHP+MySQL- Новый дизайн в html+css+jsЗадача:- Заменить дизайн, оставив PHP код как есть- Адаптировать существующие JS элементы(графики, выбор дат и тп) на соответствие новому дизайну- Проверить и иправить верстку на корректную работу на мобильныйдесктоп в разных размерах экрана- Срок выполнения 2-4 неделиИщем:- Опытного программиста PHP,JS с 5+ лет опытом- Внимание к деталям, особенно в версткеДаём:- Разумно щедрая оплата и дополнительные таски по этому же проекту в будущем"
   ]
]