[
   [
      "https://kwork.ru/projects/1373115",
      "Доработать скрипт экспорта анимаций из spine на python",
      "Нужно доработать скрипт(прикреплен) для batch экспорта анимаций из spine \nназвание скрипта spine_bath_export.py \nПараметры командной строки \nspine_bath_export.py [allavimovjson] path_to_start_folder path_to_output_folder\nгде \n[allavimovjson] - тип экспорта:\navi - экспорт в avi превью\nmov - экспорт в mov c прозрачным alfa-background \njson - экспорт в json + png atlas для вставки в игру \nall - все режимы сразу. (Этот режим является режимом по умолчанию)\npath_to_start_folder - путь к папке где лежат файлы проектов \npath_to_output_folder - путь к папке куда экспортировать результат. Экспорт должен происходить с сохранением вложенности под папок. \nПолный путь к spine.exe должен задаваться в самом скрипте или же в доп. файле config.py\nВ случае если spine позволяет экспортировать json под разные версии (к примеру 3.6.53 или 3.8.X.Y) то необходимо в настройках указать под какую версию будет экспорт \nдокументация по параметрам командной строки http:ru.esotericsoftware.comspine-command-line-interface#Import Скрыть \n\n\n\nspine_bath_export — копия.py\n\n\n\n\n\n01_Kitchen.rar"
   ],
   [
      "https://kwork.ru/projects/1382262",
      "Лёгкий Python, или любой другой язык, Бот для сайта",
      "Есть сайт ytber.ru там нужно выполнять задания, ставить лайки писать комментарии и тд.\r\nВ общем сложность примерно такая, надо чтобы он обходил капчи (Есть Api от captha.ru) . В фоновом режиме с указаными аккаунтами выполнял примитивные задачи.\r\nЕсли хотите распишу подробный план. Беру без портфолио мне важно чтобы работало.\r\nПрокси так же если нужны можете добавить, потому что мне нужно чтобы сразу несколько работало. Скрыть"
   ],
   [
      "https://kwork.ru/projects/1365829",
      "По для Telegram мессенджера",
      "Добрый день, уважаемые исполнители, на проектную работу по разработке промного обеспечения для мессенджера Telegram требуется программист.\nОсновные требования: \n1) Опыт в Python \n2) Опыт разработки стороннего ПО для мессенджера Telegram \n3) Имели опыт или понимаете как работает авторизация в Telegram (возможно опыт разработки стороннего клиента)\n4) Знание либ телеграма tdlib, telethon \nПроект долгосрочный.\nОт вас в сообщении: ответы на все 4 вопроса с примерами и опытом. Скрыть"
   ],
   [
      "https://kwork.ru/projects/1378990",
      "Backend + Frontend Моб приложения для iOS и Android",
      "Мы ищем двух очень сильных IT специалистов для разработки Мобильного Приложения.\n• 1ый - Backend или Fullstack\n• 2ой - Frontend или Fullstack\nКлючевые фишки приложения и что потребуется:\n• Интеграция Видеосвязи между пользователями\n• Интеграция Аудиосвязи между пользователями\n• Интерактивные чаты с возможностью отправлять голосовые и видео сообщения\n• Интеграция нейросети в приложение (логика есть)\n• Доп. функции\nЕсть подробное ТЗ + Прототип + Дизайн с вёрсткой. Высылается после выбора специалиста и подписания NDA.\nТребования к исполнителю:\n• Умение строго следовать дедлайнам! Работа будем идти поэтапно параллельно с тестированиям результатов и прогресса\n• Полное погружение в проект во время работы (никаких параллельных проектов)\n• Приблизительное время работы 2 месяца (full time)\n• Глубокое понимание Java Script\n• Отличное знание технологий WebRTC для видеосвязи и XMPP для чатов\n• Гибкость в внесение изменений и проактивность\n• Серьёзное портфолио работ с IT приложениями и референсы - обязательно\nОплата по договорённости по топовой рыночной ставке. Начало работы ориентировочно с 31 сентября.\nобязательно: Наличие референсов или рекомендаций по уже исполненным проектам. Скрыть"
   ],
   [
      "https://kwork.ru/projects/1379637",
      "Парсинг сайта transinfo.by",
      "Добрый день.\nНужен парсинг грузов сайта transinfo.by по всем странамрегионамгородам\nОбязательно данные записывать в mysql.\nВ случае нескольких значений какого-то параметра - записывать значения в отдельную таблицу с привязкой к номеру груза, как пример: объявления могут иметь разное кол-во контактов, потому  их писать в отдельную таблицу \"контакты\", с привязкой к номеру груза и порядковым номером в рамках номера груза.\nВ БД должны быть время записи, ссылка на компанию, что разместила объявление, и все абсолютно параметры, которые есть в заявке.\nПри разрыве интернета парсинг ожидает подключения и продолжает с места разрыва\nПри запуске проверяет дату парсинга и если она позже 24 часов - начинать парсинг с начала.\nПарсинг писать на python+sqlalchemy\nПриоритет библиотека requests, если невозможно - предоставить весомые аргументы и реализовать на selenium\nЕсли нужно - предоставлю антикапчу, прокси. Скрыть"
   ],
   [
      "https://kwork.ru/projects/1379787",
      "Сайт на Vue, quasar",
      "Всем добра!\nНужно написать сайт на vue, используя quasar.dev, чтобы далее собрать на нем мобильное приложение.\nСайт состоит из 7 основных страниц.\nСуть сайта: пользователь добавляет товар в корзину, подтверждает заказ, выбирает доставку или самовывоз.\nЗаказ улетает по API во внешнюю систему.\nБэк-енд написан с API реализован на Python.\nЧто ожидаю от специалиста:\n1. Опыт реализации проектов на Vue и quasar;\n2. Опыт реализации проектов на Python;\n3. Навыки работы с Git и Docker.\nПервое сотрудничество только через безопасную сделку.\nПрошу заинтересованных специалистов сообщить:\nа) готовый ли к долгосрочному сотрудничеству (разработке, поддержке, сопровождению сайта);\nб) стоимость вашего часа работы;\nв) рассказать про опыт разработки на vuequasar Скрыть"
   ],
   [
      "https://kwork.ru/projects/1379824",
      "Мобильное приложение на Vue, quasar",
      "Всем доброго дня!\nНужно написать приложение на vue, используя quasar.dev.\nПриложение состоит из 4 основных страниц.\nСуть приложения: создавать отчеты + загружать фото\nЗаказ улетает по API во внешнюю систему.\nБэк-енд написан с API реализован на php.\nЧто ожидаю от специалиста:\n1. Опыт реализации проектов на Vue и quasar;\n2. Опыт реализации проектов на php (преимущество для тех кто знает php и python);\n3. Навыки работы с Git и Docker.\nПервое сотрудничество через безопасную сделку.\nПрошу заинтересованных разработчиков сообщить:\nа) готовый ли к долгосрочному сотрудничеству, а именно разработке, поддержке, сопровождению приложения;\nб) стоимость часа работы;\nв) рассказать про опыт разработки на vuequasar Скрыть"
   ],
   [
      "https://kwork.ru/projects/1381401",
      "Программист",
      "Ищем амбициозных программистов\n\n **for-sale: инструменты для маркетплейсов**\nНабираем команду для разработки сервиса по маркетплейсам. Это будет лучший продукт на рынке который окупится в уже в первый месяц. \nИ ты можешь уже сейчас войти в долю и мы вместе с сможем вывести работу с маркетплейсами на новый уровень. \n\nДля реализации этого проекта нам нужны специалисты в нескольких областях и если ты спец в чем нибудь из этого, то мы тебя ждем \n#IT, python\n**Обязанности:**\n**Реализация MVP.** Главная задача на сегодня запустить mvp и запустить его на рынок. Есть фронт и все ui элементы. Большая часть функционала уже есть в модулях, которые требуют небольшой доработки\n**Требования python middle:**\n— Владение Python и FastAPI;\n— Опыт работы с Mongodb и Redis;\n— Хотя бы теоретическое знакомство с принципами асинхронной архитектуры (очереди, подписки и т. д.);\n— Умение спроектировать MVP сервиса на знакомых технологиях по требованиям бизнеса и спланировать его масштабирование в случае наплыва пользователей;\n— docker, docker-compose\n— Знание библиотек pandas numpy \n**Требования python middle**:\n— Навык парсинга сайтов (Requests, bs4, lxml, selenium)\n— Навык формирования сложных запросов и работы с динамическими сайтами \n— Опыт работы с mongodb\nЗарплата от 20000 до 200000 Скрыть"
   ],
   [
      "https://kwork.ru/projects/1382022",
      "Написать программу для сайта",
      "Необходимо сделать некий графический калькулятор (программу) \"картограф\", с последующей интеграцией на временный сайт.\nПрограмму необходимо написать на Python (Back), фронт на javascript.\nТакже рассмотрю Ваши варианты.\nДестоп не интересует\nПрикрепляю следующие файлы:\n- Техническое задание;\n- схематичный пример готового маршрута;\n- предпочтение по графике (см. Файлы скриншот)\nДетальный а также более подробную информацию предоставлю потенциальным исполнителям.\nТакже в дальнейшем необходимо будет сделать сам сайт.\nЭтапы работ:\n1. Разработка алгаритма построения маршрутов \n2. Графика\n3. Установка на временный сайт заказчика Скрыть \n\n\n\nПример готового маршрута (схемотично)-3.jpg\n\n\n\n\n\nScreenshot (пимер графики в программе).jpg\n\n\n\n\n\nшаблон иконок для сооружений.xlsx\n\n\n\n\n\nТребования к программе картограф.docx\n\n\n\n\n\nПример алгоритма построения маршрут в программе картограф.xlsx\n\n\n\n\n\nОбщее тех.задание.docx"
   ]
]